<html>
<head>
    <meta http-equiv="X-UA-Compatible" content="IE=Edge" />
    <meta charset="utf-8">
    
	<title>Aide Soumission Rapide Flexibles</title>
    <style>
		img { display:block; }
		ol {background-color: #eee; }
		li {
		padding: 8px 0px; 
		}
        p.alert {color:crimson}
		
	</style>
    <link rel="stylesheet" href="css/bootstrap.min.css" type="text/css">
    <link rel="stylesheet" href="css/bootstrap-theme.min.css" type="text/css">
</head>
<body>
<div class="container">

<p><a href="index.html">Retour à Aide</a></p>

<h2>Module de Soumission Rapide Flexible</h2>

<p>Ce module permet de remplir une soumission avec calcul d&#39;estimation automatique. &Agrave; la fin, la soumission peut &ecirc;tre imprim&eacute;e et transf&eacute;r&eacute;e dans Access (pour mise en production).</p>
<p class="info bg-info">NOTE: dès qu'une modification est faite dans le formulaire, les calculs s'ajustent automatiquement. L'information affichée est donc toujours à jour.</p>
<ol>
	<li>Pour acc&eacute;der au module de Soumission Rapide, cliquer sur le lien Soumission&nbsp;<img alt="" src="images\Soumflex_lien.png" /></li>
	<li>Le formulaire de soumission appara&icirc;t.</li>
	<li>Dans la section <strong>Ent&ecirc;te</strong>, entrer le <strong>Nom du Projet</strong>.<img alt="" src="images\Soumflex_entete.png" /></li>
	<li>NOTE: on peut se d&eacute;placer par clavier entre les champs du formulaire avec la touche de tabulation (TAB). Cette touche se trouve &agrave; gauche de votre clavier, g&eacute;n&eacute;ralement au-dessus du caps lock (touche de verrouillage majuscule ou MAJ)</li>
	<li>Choisir ensuite un repr&eacute;sentant dans la liste d&eacute;roulante <strong>Repr&eacute;sentant </strong>(ou commencer &agrave; taper son nom).</li>
	<li>Choisir ensuite un client dans la liste d&eacute;roulante <strong>Client </strong>(ou commencer &agrave; taper le nom du client).</li>
	<li>Si les coordonn&eacute;es du <strong>Contact </strong>client sont connues, vous pouvez les entrer dans la ligne des coordonn&eacute;es du contact, mais elles demeurent facultatives. Pour le t&eacute;l&eacute;phone, le format accept&eacute; est xxx-xxx-xxxx (on accepte aussi le point &quot;.&quot; ou l&#39;espace &agrave; la place du tiret &quot;-&quot;).&nbsp; Pour l'email, le format accepté doit comprendre au moins le caractère "@" et un point suivi d'au-moins 2 caractères pour l'extension (.com, .org, .ca) <img alt="" src="images\Soumflex_contact.png" /></li>
	<li>Champ <strong>Date Requise</strong> : choisir la date requise par votre client (date d&eacute;sir&eacute;e&nbsp;de livraison par exemple) en cliquant sur le bouton avec l&#39;ic&ocirc;ne de calendrier &agrave; droite du champ.<img alt="" src="images\Soumflex_dateRequise.png" />&nbsp;Un petit calendrier appara&icirc;t et vous pouvez s&eacute;lectionner le mois, le jour ou m&ecirc;me l&#39;ann&eacute;e. En cliquant sur une journ&eacute;e, le calendrier se ferme et la date choisie appara&icirc;t dans la bo&icirc;te du champ.</li>
	<li>Champ <strong>Date d&#39;Estimation</strong> : ce champ est rempli automatiquement avec la date du jour.</li>
	<li>Dans la section <strong>D&eacute;tail des items</strong>, on sp&eacute;cifie le mat&eacute;riel est les mains d&#39;oeuvres pour l&#39;item.</li>
	<li>Dans la sous-section <strong>Description Item</strong>, on entre la quantit&eacute;, les dimensions en pouces et la perte pour l&#39;item. Les superficies se calculent automatiquement. On peut également choisir un mode Recto-Verso (facultatif). <img alt="" src="images\Soumflex_itemDescription.png" /></li>
	<li>Dans la sous-section <strong>Mat&eacute;riel</strong>, on choisit un produit sp&eacute;cifique dans la liste d&eacute;roulante <strong>Produit</strong>. La liste d&eacute;roulante <strong>Support </strong>peut servir &agrave; filtrer un certains type de produit (par exemple, seulement les banni&egrave;res ou les vinyles autocollants). Par d&eacute;faut, tous les produits flexibles sont list&eacute;s.<img alt="" src="images\Soumflex_itemMateriel.png" /></li>
	<li>D&egrave;s qu&#39;un mat&eacute;riel est choisi, on voit s&#39;afficher automatiquement des informations concernant le produit, ainsi qu&#39;un calcul du prix co&ucirc;tant et du prix de vente, calcul&eacute; selon les dimensions de l&#39;item entr&eacute;s &agrave; la section Description Item. Si jamais ces dimensions sont modifi&eacute;es, le calcul de la section Mat&eacute;riel se met &agrave; jour.<img alt="" src="images\Soumflex_itemMaterielPrix.png" /></li>
	<li>Dans la sous-section <strong>Imprimante</strong>, on choisit dans la liste d&eacute;roulante <strong>Imprimante</strong>, la machine qui va servir &agrave; imprimer : seulement les machines compatibles avec le produit choisi seront list&eacute;es.<img alt="" src="images\Soumflex_itemImprimante.png" />&nbsp;Le calcul du prix de l&#39;impression est affich&eacute; en-dessous de l&#39;imprimante choisie.</li>
	<li>Dans la sous-section <strong>Infographie</strong>, on ajoute automatiquement un temps minimal d&#39;infographie. On peut ajuster simplement le nombre de visuels, et cela ajuste automatiquement le temps et le co&ucirc;t requis.<img alt="" src="images\Soumflex_itemInfographie.png" />&nbsp;(en-bas de 3 visuels, ne change pas le temps; le nombre de visuels est en g&eacute;n&eacute;ral &eacute;gal ou plus petit que la quantit&eacute; d&#39;items)</li>
	<li>Dans la sous-section <strong>Main d&#39;oeuvre</strong>, on ajoute automatiquement un temps minimal de main d&#39;oeuvre et du mat&eacute;riel d&#39;emballage. Si jamais l&#39;item &agrave; produire n&eacute;cessite du temps suppl&eacute;mentaire de main d&#39;oeuvre vous pouvez s&eacute;lectionner un temps extra dans la liste d&eacute;roulante de la colonne Temps / Quantit&eacute;.<img alt="" src="images\Soumflex_itemMainDoeuvre.png" /></li>
	<li>Dans la sous-section <strong>Finition</strong>, vous pouvez sp&eacute;cifier une finition &nbsp;si applicable.</li>
	<li>Si applicable, la liste d&eacute;roulante du&nbsp;<strong>Type </strong>vous permet de choisir un type&nbsp;de finition :&nbsp;<img alt="" src="images\Soumflex_itemFinitionType.png" /></li>
	<li>Ensuite, la liste d&eacute;roulante des&nbsp;C&ocirc;t&eacute;(s) vous permet de choisir sur quels c&ocirc;t&eacute;s appliquer la finition :&nbsp;<img alt="" src="images\Soumflex_itemFinitionCote.png" /></li>
	<li>Le calcul total de la finition se fait automatiquement.<img alt="" src="images\Soumflex_itemFinitionTotal.png" /></li>
	<li>Dans la sous-section <strong>Laminage</strong>, la liste d&eacute;roulante dans la colonne Type contient les laminages qui peuvent s&#39;appliquer au produit choisi (parfois aucun laminage n&#39;est applicable).<img alt="" src="images\Soumflex_itemLaminage.png" />&nbsp; D&egrave;s qu&#39;un laminage est choisi, on voit appara&icirc;tre le calcul d&#39;estimation automatique dans une table:&nbsp;<img alt="" src="images\Soumflex_itemLaminagePrix.png" /></li>
    
<li>En-dessous de toutes les sous-sections se trouve un tableau résumant les coûts totaux de l'item. 
    <img alt="" src="images/Soumflex_itemResume.PNG">
    Pour le vendeur, l'information importante est la commission calculée ainsi que le total estimé. Dans la case <strong>Montant des Ventes</strong>, il faut entrer un prix de vente qui sera nécessairement plus grand que l'estimé de l'item.
    <img alt="" src="images/Soumflex_prix.png"></li>    
    
<li><strong>Ajouter un item : </strong> cliquer sur le bouton <img alt="" src="images/Soumflex_ajoutItem.png"></li>
    
<li><strong>Retirer un item : </strong> pour retirer un item de la soumission, cliquer sur le bouton <img alt="" src="images/Soumflex_retraitItem.PNG"></li>
    
	<li>Dans la section <strong>Options de prix</strong>, est présenté le résumé de toute la soumission.
     <img alt="" src="images/Soumflex_prixEntre.png">
     Dans cet exemple, il est égal au résumé de l'item 1 puisqu'on n'a qu'un seul item. Par contre, si on avait 2 items ou plus, on aurait ici la somme des coûts de tous les items.
    </li>
    <li>Lorsque tout le formulaire est bien complété, on peut alors choisir de Sauvegarder la soumission. Ceci a pour effet : a) de créer une nouvelle soumission dans Access avec les informations du formulaire et b) d'afficher une page imprimable qui contient les détails de la soumission pour envoyer au client. 
        <p class="alert bg-danger">ATTENTION : en cliquant sur le bouton <strong>Sauvegarder la soumission</strong> vous ne pourrez plus éditer le formulaire, car une nouvelle page sera présentée. Par contre, la soumission aura été créée dans Access où vous pourrez la modifier et la mettre en production comme d'habitude.</p>
        <img alt="" src="images\Soumflex_sauver.png" />
    </li>
    <li>Après avoir cliqué sur le bouton Sauvegarder, la page de soumission client s'affiche : cette page peut être imprimée pour envoi au client. Notez le numéro de la soumission affiché au coin supérieur droit de la page (encerclé en rouge sur l'image ci-dessous).
	<img alt="" src="images\Soumflex_soumclient.png" width="1000px" height="auto"/></li>
</ol>
    

	<p><a href="index.html">Retour à Aide</a></p>	
	</div>
</body>
</html>
